app/Controllers/Admin.php

SELECT *
FROM `tbl_admin`
WHERE `email` = 'juandelacruz@gmail.com'
AND `password` = 'aafdc23870ecbcd3d557b6423a8982134e17927e'
 LIMIT 1
---
    public function login()
    {
        $admin_model = new \App\Models\AdminModel();
        if ($this->request->getMethod() == 'post') {
            $post = $this->request->getPost(['email', 'password']);

            $admin = $admin_model->where('email', $post['email'])
                ->where('password', sha1($post['password']))
                ->first();