app/Controllers/Item.php

SELECT *
FROM `tbl_item`
---
    public function index()
    {
        if (session()->get('isAdminLoggedIn')) {

            $item_model = new ItemModel;
            $data['items'] = $item_model->findAll();

SELECT *
FROM `tbl_item`
WHERE `tbl_item`.`id` = '1'
---
            }
        }

        $data['item'] = $itemModel->find($id);